# Налог на недвижимое имущество. Муниципальный округ собирает налоги на недвижимое имущество
# на основе оценочной стоимости имущества, составляющей 60% его фактической стоимости.
# Например, если акр земли оценен в 1 О ООО долларов, то его оценочная стоимость составит 6000 долларов.
# В этом случае налог на имущество составит
# 72 цента за каждые 100 долларов оценочной стоимости. Налог на акр, оцененный
# в 6000 долларов, составит 43.20 доллара. Напишите программу, которая запрашивает
# фактическую стоимость недвижимого имущества и показывает оценочную стоимость и
# налог на имущество.