# . Средний балл и его уровень. Напишите программу, которая просит пользователя ввести
# пять экзаменационных оценок (баллов). Программа должна показать буквенный
# уровень для каждой оценки и средний балл. Предусмотрите в программе функции:
# • calc_average - функция должна принимать в качестве аргументов пять балльных
# оценок и возвращать средний балл;
# • determine_grade - функция должна принимать в качестве аргумента балльную
# оценку и возвращать буквенный уровень оценки, опираясь на приведенную в таблице
# классификацию.
#
# Баллы         Уровень
# 90 и выше     А
# 80-89         в
# 70-79         C
# 60-69         D
# Ниже 60       F