# Кинетическая энергия. Из физики известно, что движущееся тело имеет кинетическую
# энергию. Приведенная ниже формула может использоваться для определения кинетической энергии движущегося тела:
# К"= 1/2mv2,
# где К" - это кинетическая энергия; т - масса тела, кг; v - скорость тела, м/с.
# Напишите функцию kinetic_energy, которая в качестве аргументов принимает массу
# тела (в килограммах) и его скорость (в метрах в секунду). Данная функция должна
# вернуть величину кинетической энергии этого тела. Напишите программу, которая просит пользователя
# ввести значения массы и скорости, а затем вызывает функцию
# kinetic _ energy, чтобы получить кинетическую энергию тела.