# Месячный налог с продаж. Розничная компания должна зарегистрировать отчет омесячном налоге с продаж
# с указанием общего налога с продаж за месяц и взимаемых
# сумм муниципального и федерального налогов с продаж. Федеральный налог с продаж
# составляет 5%, муниципальный налог с продаж- 2,5%. Напишите программу, которая
# просит пользователя ввести общий объем продаж за месяц. Из этого значения приложение должно рассчитать и показать:
# • сумму муниципального налога с продаж;
# • сумму федерального налога с продаж;
# • общий налог с продаж (муниципальный плюс федеральный).