# . Высота падения. При падении тела под действием силы тяжести для определения расстояния,
# которое тело пролетит за определенное время, применяется формула:
# d = 1/2gt**2,
# где d- расстояние, м; g = 9.8, м/с**2 ; t - время падения тела, с.
# Напишите функцию falling_ distance, которая в качестве аргумента принимает время
# падения тела (в секундах). Функция должна вернуть расстояние в метрах, которое тело
# пролетело в течение этого времени. Напишите программу, которая вызывает эту функцию в цикле, передает
# значения от 1 до 10 в качестве аргументов и показывает возвращаемое значение.