# Оценщик малярных работ. Малярная компания установила, что на каждые 1 О квадратных метров поверхности стены требуется
# 5 литров краски и 8 часов работы. Компания взимает за работу 2000 руб. в час.
# Напишите программу, которая просит пользователя ввести площадь поверхности окрашиваемой стены
# и цену 5-литровой емкости краски. Программа должна показать следующие данные:
# • количество требуемых емкостей краски;
# • количество затраченных рабочих часов;
# • стоимость краски;
# • стоимость работы;
# • общая стоимость малярных работ.