# Пользователь вводит произвольную строку.
# Выведите кортеж из уникальных символов введённой строки.

tuple_task = tuple(input())
print(tuple_task)